Revit 2026 API

# ScheduleDefinitionInsertCombinedParameterField Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ScheduleField InsertCombinedParameterField(
	IList<TableCellCombinedParameterData> data,
	string fieldName,
	int index
)
```
```vb
Public Function InsertCombinedParameterField (
	data As IList(Of TableCellCombinedParameterData),
	fieldName As String,
	index As Integer
) As ScheduleField
```
```cpp
public:
ScheduleField^ InsertCombinedParameterField(
	IList<TableCellCombinedParameterData^>^ data,
	String^ fieldName,
	int index
)
```
```fsharp
member InsertCombinedParameterField :
        data : IList<TableCellCombinedParameterData> *
        fieldName : string *
        index : int -> ScheduleField
```

#### Parameters

data IListTableCellCombinedParameterData

fieldName String

index Int32

#### Return Value

ScheduleField

#### Reference

ScheduleDefinition Class

Autodesk.Revit.DB Namespace